---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TextureRealWorldScaleX
source: html/2dd17914-c939-f7aa-1bea-c3cb62d15076.htm
---
# Autodesk.Revit.DB.Visual.Tile.TextureRealWorldScaleX Property

The property labeled "Size X" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".